# Pivot Table

In [11]:
import pandas as pd
import numpy as np
from pandas import DataFrame,Series

In [12]:
df=DataFrame({'Names':['Boby','Peter','Nicky','Boby','Peter','Nicky','Boby','Peter','Nicky','Boby','Peter','Nicky'],
              'Exam':['Semester 1','Semester 1','Semester 1','Semester 1','Semester 1','Semester 1','Semester 2','Semester 2','Semester 2','Semester 2','Semester 2','Semester 2'],
              'Subject':['Mathematics','Mathematics','Mathematics','Science','Science','Science','Mathematics','Mathematics','Mathematics','Science','Science','Science'],
              'Score':np.random.randint(50,100,12)})

In [13]:
df

    Names        Exam      Subject  Score
0    Boby  Semester 1  Mathematics     85
1   Peter  Semester 1  Mathematics     79
2   Nicky  Semester 1  Mathematics     77
3    Boby  Semester 1      Science     62
4   Peter  Semester 1      Science     78
5   Nicky  Semester 1      Science     97
6    Boby  Semester 2  Mathematics     87
7   Peter  Semester 2  Mathematics     63
8   Nicky  Semester 2  Mathematics     52
9    Boby  Semester 2      Science     58
10  Peter  Semester 2      Science     58
11  Nicky  Semester 2      Science     91

In [14]:
pd.pivot_table(df, index=['Exam','Subject'],aggfunc='mean')
#pivot table using aggregate function

                            Score
Exam       Subject
Semester 1 Mathematics  80.333333
           Science      79.000000
Semester 2 Mathematics  67.333333
           Science      69.000000

In [15]:
pd.pivot_table(df,index=['Exam','Subject'],aggfunc='count')

                        Names  Score
Exam       Subject
Semester 1 Mathematics      3      3
           Science          3      3
Semester 2 Mathematics      3      3
           Science          3      3

In [16]:
pd.pivot_table(df,index=['Names','Subject'],aggfunc='sum')

                   Score
Names Subject
Boby  Mathematics    172
      Science        120
Nicky Mathematics    129
      Science        188
Peter Mathematics    142
      Science        136

In [17]:
#group by rom below topic

In [18]:
df

    Names        Exam      Subject  Score
0    Boby  Semester 1  Mathematics     85
1   Peter  Semester 1  Mathematics     79
2   Nicky  Semester 1  Mathematics     77
3    Boby  Semester 1      Science     62
4   Peter  Semester 1      Science     78
5   Nicky  Semester 1      Science     97
6    Boby  Semester 2  Mathematics     87
7   Peter  Semester 2  Mathematics     63
8   Nicky  Semester 2  Mathematics     52
9    Boby  Semester 2      Science     58
10  Peter  Semester 2      Science     58
11  Nicky  Semester 2      Science     91

In [20]:
#Type 1
df['Score'].groupby(df['Exam'])

In [22]:
df['Score'].groupby(df['Exam']).mean()

Exam
Semester 1    79.666667
Semester 2    68.166667
Name: Score, dtype: float64

In [23]:
df['Score'].groupby(df['Exam']).count()

Exam
Semester 1    6
Semester 2    6
Name: Score, dtype: int64

In [24]:
df['Score'].groupby(df['Exam']).max()

Exam
Semester 1    97
Semester 2    91
Name: Score, dtype: int32

In [31]:
#type-2
arr=np.array(['a','b','c','d','e','f','a','b','c','d','e','a'])
arr

array(['a', 'b', 'c', 'd', 'e', 'f', 'a', 'b', 'c', 'd', 'e', 'a'],
      dtype='<U1')

In [32]:
df['Score'].groupby([arr]).count()

a    3
b    2
c    2
d    2
e    2
f    1
Name: Score, dtype: int64

In [33]:
df['Score'].groupby([arr]).max()

a    91
b    79
c    77
d    62
e    78
f    97
Name: Score, dtype: int32

In [34]:
#Type-3
df.groupby(['Exam']).mean()

                Score
Exam
Semester 1  79.666667
Semester 2  68.166667

In [37]:
df.groupby(['Exam']).count()

            Names  Subject  Score
Exam
Semester 1      6        6      6
Semester 2      6        6      6

In [39]:
df.groupby(['Subject']).max()

             Names        Exam  Score
Subject
Mathematics  Peter  Semester 2     87
Science      Peter  Semester 2     97

In [40]:
#Type-4
df.groupby(['Exam','Subject']).mean()

                            Score
Exam       Subject
Semester 1 Mathematics  80.333333
           Science      79.000000
Semester 2 Mathematics  67.333333
           Science      69.000000

In [41]:
df.groupby(['Exam','Subject']).max()

                        Names  Score
Exam       Subject
Semester 1 Mathematics  Peter     85
           Science      Peter     97
Semester 2 Mathematics  Peter     87
           Science      Peter     91

In [44]:
#Type-5
#Type-6